test/aachenBomb_2D/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
libs (
      "libEvaporationNew.so"
     );

application     dfLowMachFoam;

startFrom       startTime;

startTime       0;

stopAt          endTime;

endTime         2.3e-3;

deltaT          2.5e-06;

writeControl    adjustableRunTime;

writeInterval   1e-04;

purgeWrite      0;

writeFormat     ascii;

writePrecision  6;

writeCompression on;

timeFormat      general;

timePrecision   6;

adjustTimeStep  no;

maxCo           0.1;

runTimeModifiable yes;


// ************************************************************************* //
