test/aachenBomb_2D/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 0.001;

vertices
(
    (-10 0 -1e-3)
    (-10 0  1e-3)
    (10 0   1e-3)
    (10 0  -1e-3)
    (-10 100 -1e-3)
    (-10 100  1e-3)
    (10 100   1e-3)
    (10 100  -1e-3)
);

blocks
(
    hex (0 1 2 3 4 5 6 7) (1 41 100) simpleGrading (1 1 1)
);

edges
(
);

boundary
(
    walls
    {
        type wall;
        faces
        (
            (4 5 6 7)
            (3 2 1 0)
            (7 6 2 3)
            (0 1 5 4)
        );
    }
    empty
    {
        type empty;
        faces
        (
            (2 6 5 1)
            (0 4 7 3)
        );
    }
);

mergePatchPairs
(
);

// ************************************************************************* //
